<br><br>
<font size='6'><b>Python & Pandas basics </b></font><br><br>

<br>
<div class=pull-right>
By Prof. Seungchul Lee<br>
http://iai.postech.ac.kr/<br>
Industrial AI Lab at POSTECH
</div>

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Pandas-기초" data-toc-modified-id="Pandas-기초-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Pandas 기초</a></span><ul class="toc-item"><li><span><a href="#설치-&amp;-시작" data-toc-modified-id="설치-&amp;-시작-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>설치 &amp; 시작</a></span></li><li><span><a href="#데이터-정리" data-toc-modified-id="데이터-정리-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>데이터 정리</a></span></li><li><span><a href="#파일-저장-&amp;-읽기" data-toc-modified-id="파일-저장-&amp;-읽기-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>파일 저장 &amp; 읽기</a></span></li><li><span><a href="#데이터-분석-&amp;-전처리" data-toc-modified-id="데이터-분석-&amp;-전처리-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>데이터 분석 &amp; 전처리</a></span></li></ul></li><li><span><a href="#프로젝트" data-toc-modified-id="프로젝트-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>프로젝트</a></span><ul class="toc-item"><li><span><a href="#NaN-비율-확인" data-toc-modified-id="NaN-비율-확인-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>NaN 비율 확인</a></span></li><li><span><a href="#데이터-선별-후,-비중-확인" data-toc-modified-id="데이터-선별-후,-비중-확인-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>데이터 선별 후, 비중 확인</a></span></li><li><span><a href="#name_id_code" data-toc-modified-id="name_id_code-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>name_id_code</a></span></li></ul></li></ul></div>

# Pandas 기초

## 설치 & 시작

- **설치**

In [11]:
!pip install pandas

Requirement already satisfied: pandas in /mnt/disk1/jonghwan/.vrpy378/lib/python3.7/site-packages (1.1.2)
Requirement already satisfied: python-dateutil>=2.7.3 in /mnt/disk1/jonghwan/.vrpy378/lib/python3.7/site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.15.4 in /mnt/disk1/jonghwan/.vrpy378/lib/python3.7/site-packages (from pandas) (1.18.5)
Requirement already satisfied: pytz>=2017.2 in /mnt/disk1/jonghwan/.vrpy378/lib/python3.7/site-packages (from pandas) (2020.1)
Requirement already satisfied: six>=1.5 in /mnt/disk1/jonghwan/.vrpy378/lib/python3.7/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
WARNING: You are using pip version 20.2.2; however, version 21.0.1 is available.
You should consider upgrading via the '/mnt/disk1/jonghwan/.vrpy378/bin/python -m pip install --upgrade pip' command.

- **시작**

In [1]:
import pandas as pd

## 데이터 정리

In [2]:
import numpy as np

- **알아보기 어려운 데이터**

In [3]:
data = {"name_id_code" : ['0', '105', '12', '130'],
       "year" : [2014, 2015, 2016, 2017],
       "points" : [10, 15, 30, 5],
       "penalty" : [1, 2, 5, 0]}

- **직관적인 데이터 정리**

In [4]:
df = pd.DataFrame(data, columns = ['year', 'name_id_code', 'points', 'penalty'], 
                        index = ['1','2','3','4'])

In [5]:
df

   year name_id_code  points  penalty
1  2014            0      10        1
2  2015          105      15        2
3  2016           12      30        5
4  2017          130       5        0

## 파일 저장 & 읽기

- **저장**

In [30]:
df.to_csv('./save_files_2/save_data.csv')

- **읽기**

In [31]:
pd.read_csv('./save_files/save_data.csv')

   Unnamed: 0  year  name_id_code  points  penalty
0           1  2014             0      10        1
1           2  2015           105      15        2
2           3  2016            12      30        5
3           4  2017           130       5        0

- **기존의 index 사용**

In [32]:
load_data = pd.read_csv('./save_files/save_data.csv')

In [33]:
load_data_2 = load_data.set_index('Unnamed: 0')

In [34]:
load_data_2

            year  name_id_code  points  penalty
Unnamed: 0
1           2014             0      10        1
2           2015           105      15        2
3           2016            12      30        5
4           2017           130       5        0

## 데이터 분석 & 전처리

- **새로운 데이터 정의(복습)**

In [6]:
data_2 = {"name_id_code" : ['1000', '1105', '998', '1001'],
       "year" : [2018, 2019, 2020, 2021],
       "points" : [100, 90, 60, 55],
       "penalty" : [5, 10, 5, 5]}

In [7]:
df_2 = pd.DataFrame(data_2, columns = ['year', 'name_id_code', 'points', 'penalty'], 
                        index = ['5','6','7','8'])

In [8]:
df_2

   year name_id_code  points  penalty
5  2018         1000     100        5
6  2019         1105      90       10
7  2020          998      60        5
8  2021         1001      55        5

- **mean/std**

In [39]:
df_2['points']

5    100
6     90
7     60
8     55
Name: points, dtype: int64

In [40]:
df_2['points'].mean()

76.25

In [41]:
df_2['points'].std()

22.12653007891959

- **min/max**

In [45]:
df_2['points'].min()

55

In [43]:
df_2['points'].max()

100

- **종합적인 분석**

In [49]:
df_2.describe()

              year     points  penalty
count     4.000000    4.00000     4.00
mean   2019.500000   76.25000     6.25
std       1.290994   22.12653     2.50
min    2018.000000   55.00000     5.00
25%    2018.750000   58.75000     5.00
50%    2019.500000   75.00000     5.00
75%    2020.250000   92.50000     6.25
max    2021.000000  100.00000    10.00

- **데이터 type 확인**

In [47]:
df_2.dtypes

year             int64
name_id_code    object
points           int64
penalty          int64
dtype: object

- **데이터 형식 변경**

In [50]:
df_2_float = df_2.astype('float')

In [52]:
df_2_float.dtypes

year            float64
name_id_code    float64
points          float64
penalty         float64
dtype: object

In [53]:
df_2_float_2 = df_2.astype({'name_id_code':int})

In [54]:
df_2_float_2.dtypes

year            int64
name_id_code    int64
points          int64
penalty         int64
dtype: object

- **종합적인 분석(확인)**

In [55]:
df_2_float_2.describe()

              year  name_id_code     points  penalty
count     4.000000      4.000000    4.00000     4.00
mean   2019.500000   1026.000000   76.25000     6.25
std       1.290994     52.681433   22.12653     2.50
min    2018.000000    998.000000   55.00000     5.00
25%    2018.750000    999.500000   58.75000     5.00
50%    2019.500000   1000.500000   75.00000     5.00
75%    2020.250000   1027.000000   92.50000     6.25
max    2021.000000   1105.000000  100.00000    10.00

- **isin**

In [56]:
df_2_float_2

   year  name_id_code  points  penalty
5  2018          1000     100        5
6  2019          1105      90       10
7  2020           998      60        5
8  2021          1001      55        5

In [57]:
df_2_float_2[df_2_float_2['points'].isin([100])]

   year  name_id_code  points  penalty
5  2018          1000     100        5

- **isin 응용**

In [58]:
df_2_float_2[df_2_float_2['points'].isin([100]) | df_2_float_2['penalty'].isin([10])]

   year  name_id_code  points  penalty
5  2018          1000     100        5
6  2019          1105      90       10

- **조건문**

In [59]:
df_2_float_2[df_2_float_2['points']<=60]

   year  name_id_code  points  penalty
7  2020           998      60        5
8  2021          1001      55        5

- **조건문 응용**

In [61]:
df_2_float_2

   year  name_id_code  points  penalty
5  2018          1000     100        5
6  2019          1105      90       10
7  2020           998      60        5
8  2021          1001      55        5

In [63]:
df_2_float_2[(df_2_float_2['points']>=60) & (df_2_float_2['penalty']>5)]

   year  name_id_code  points  penalty
6  2019          1105      90       10

- **새로운 데이터 정의(복습)**

In [12]:
data_3 = {"name_id_code" : [np.nan, 1305, np.nan, 4854],
       "year" : [2021, 2021, 2021, 2021],
       "points" : [80, 85, 70, 75],
       "penalty" : [0, np.nan, 15, 10]}

In [13]:
df_3 = pd.DataFrame(data_3, columns=['year', 'name_id_code', 'points', 'penalty'],
                            index=['9', '10', '11', '12'] )

In [14]:
df_3

    year  name_id_code  points  penalty
9   2021           NaN      80      0.0
10  2021        1305.0      85      NaN
11  2021           NaN      70     15.0
12  2021        4854.0      75     10.0

In [15]:
df_3_temp = pd.DataFrame(data_3, columns=['year', 'name_id_code', 'points', 'penalty'] )

- **NaN 확인**

In [16]:
df_3.isna()

     year  name_id_code  points  penalty
9   False          True   False    False
10  False         False   False     True
11  False          True   False    False
12  False         False   False    False

- **NaN 제거**

In [17]:
df_3.dropna(axis=0)

    year  name_id_code  points  penalty
12  2021        4854.0      75     10.0

In [18]:
df_3.dropna(axis=1)

    year  points
9   2021      80
10  2021      85
11  2021      70
12  2021      75

- **데이터 합치기**

In [9]:
df

   year name_id_code  points  penalty
1  2014            0      10        1
2  2015          105      15        2
3  2016           12      30        5
4  2017          130       5        0

In [10]:
df_2

   year name_id_code  points  penalty
5  2018         1000     100        5
6  2019         1105      90       10
7  2020          998      60        5
8  2021         1001      55        5

In [19]:
df_3

    year  name_id_code  points  penalty
9   2021           NaN      80      0.0
10  2021        1305.0      85      NaN
11  2021           NaN      70     15.0
12  2021        4854.0      75     10.0

In [20]:
df_total = pd.concat([df, df_2, df_3], axis=0)

In [21]:
df_total

    year name_id_code  points  penalty
1   2014            0      10      1.0
2   2015          105      15      2.0
3   2016           12      30      5.0
4   2017          130       5      0.0
5   2018         1000     100      5.0
6   2019         1105      90     10.0
7   2020          998      60      5.0
8   2021         1001      55      5.0
9   2021          NaN      80      0.0
10  2021         1305      85      NaN
11  2021          NaN      70     15.0
12  2021         4854      75     10.0

In [82]:
df_total_temp = pd.concat([df, df_2, df_3_temp], axis=0)

In [83]:
df_total_temp

   year name_id_code  points  penalty
1  2014            0      10      1.0
2  2015          105      15      2.0
3  2016           12      30      5.0
4  2017          130       5      0.0
5  2018         1000     100      5.0
6  2019         1105      90     10.0
7  2020          998      60      5.0
8  2021         1001      55      5.0
0  2021          NaN      80      0.0
1  2021         1305      85      NaN
2  2021          NaN      70     15.0
3  2021         4854      75     10.0

# 프로젝트

In [22]:
df_total

    year name_id_code  points  penalty
1   2014            0      10      1.0
2   2015          105      15      2.0
3   2016           12      30      5.0
4   2017          130       5      0.0
5   2018         1000     100      5.0
6   2019         1105      90     10.0
7   2020          998      60      5.0
8   2021         1001      55      5.0
9   2021          NaN      80      0.0
10  2021         1305      85      NaN
11  2021          NaN      70     15.0
12  2021         4854      75     10.0

## NaN 비율 확인

In [135]:
'''
각 열마다, NaN 수 구하기
(isna, values, sum 사용)
'''
per_nan = df_total.isna().sum() / len(df_total)*100

In [128]:
'''
각 열마다, NaN 수 비율 구하기
(shape 사용)
'''
check_nan = df_total.isna().values
check_nan = check_nan.sum(axis=0)
per_nan = (check_nan/df_total.shape[0])*100
per_nan

array([ 0.        , 16.66666667,  0.        ,  8.33333333])

In [130]:
print('year column 에서 NaN 비율(%) :', per_nan[0])
print('name_id_code column 에서 NaN 비율(%) :', np.round(per_nan[1],2))
print('points column 에서 NaN 비율(%) :', per_nan[2])
print('penalty column 에서 NaN 비율(%) :', np.round(per_nan[3],2))

year column 에서 NaN 비율(%) : 0.0
name_id_code column 에서 NaN 비율(%) : 16.67
points column 에서 NaN 비율(%) : 0.0
penalty column 에서 NaN 비율(%) : 8.33

## 데이터 선별 후, 비중 확인

In [145]:
# points가 30 점 이상, 90 점 이하 데이터 선별
selected_data = df_total[(df_total['points']>=30) & (df_total['points']<=90)]

In [146]:
selected_data

    year name_id_code  points  penalty
3   2016           12      30      5.0
6   2019         1105      90     10.0
7   2020          998      60      5.0
8   2021         1001      55      5.0
9   2021          NaN      80      0.0
10  2021         1305      85      NaN
11  2021          NaN      70     15.0
12  2021         4854      75     10.0

In [147]:
per_selected_data = (selected_data.shape[0]/df_total.shape[0])*100
per_selected_data

66.66666666666666

In [36]:
'''
선별된 데이터가 전체 데이터에서 차지하는 비중 구하기
'''
per_selected_data = len(selected_data) / len(df_total)*100

In [37]:
print('selected data가 전체 data에서 차지하는 비중(%) :', np.round(per_selected_data,2))

selected data가 전체 data에서 차지하는 비중(%) : 66.67

## name_id_code

In [149]:
'''
선별된 데이터에서 penalty가 5점인 데이터 최종 선별
'''
#selected_data[selected_data['penalty']==5]
selected_data[selected_data['penalty'].isin([5])]

   year name_id_code  points  penalty
3  2016           12      30      5.0
7  2020          998      60      5.0
8  2021         1001      55      5.0

In [150]:
'''
최종 선별된 데이터의 name_id_code
'''
selected_penal = selected_data[selected_data['penalty'].isin([5])]

In [152]:
selected_penal['name_id_code']

3      12
7     998
8    1001
Name: name_id_code, dtype: object

In [151]:
print('최종 조건을 만족하는 name_id_code_1 :', selected_penal['name_id_code'][0]) # selected_penal['name_id_code'].iloc[0])
print('최종 조건을 만족하는 name_id_code_2 :', selected_penal['name_id_code'][1]) # selected_penal['name_id_code'].iloc[1])
print('최종 조건을 만족하는 name_id_code_3 :', selected_penal['name_id_code'][2]) # selected_penal['name_id_code'].iloc[2])

최종 조건을 만족하는 name_id_code_1 : 12
최종 조건을 만족하는 name_id_code_2 : 998
최종 조건을 만족하는 name_id_code_3 : 1001